<?php

return [
    [
        'name' => 'Телевизоры, видео и Hi-Fi',
        '__children' => [
            [
                'name' => 'Телевизоры',
                '__children' => [
                    [
                        'name' => '4K телевизоры',
                    ],
                    [
                        'name' => 'Full HD телевизоры',
                    ],
                    [
                        'name' => 'ЖК-телевизоры'
                    ],
                    [
                        'name' => 'Смарт-телевизоры'
                    ]
                ]
            ],
            [
                'name' => 'Видеотехника',
                '__children' => [
                    [
                        'name' => 'Домашние кинотеатры',
                    ],
                    [
                        'name' => 'Саундбары',
                    ],
                    [
                        'name' => 'Проекторы'
                    ]
                ]
            ],
            [
                'name' => 'Hi-fi техника',
                '__children' => [
                    [
                        'name' => 'Акустика',
                    ],
                    [
                        'name' => 'Ресиверы',
                    ],
                    [
                        'name' => 'Компоненты'
                    ]
                ]
            ],
            [
                'name' => 'Аксессуары'
            ]
        ]
    ],
    [
        'name' => 'Фото и видео',
        '__children' => [
            [
                'name' => 'Фотоаппараты',
                '__children' => [
                    [
                        'name' => 'Зеркальные',
                    ],
                    [
                        'name' => 'Системные',
                    ],
                    [
                        'name' => 'Ультразумы'
                    ],
                    [
                        'name' => 'Компактные'
                    ]
                ]
            ],
            [
                'name' => 'Видеокамеры',
                '__children' => [
                    [
                        'name' => 'Экшн-камеры',
                    ],
                    [
                        'name' => 'Квадрокоптеры',
                    ],
                    [
                        'name' => 'Цифровые видеокамеры'
                    ]
                ]
            ],
            [
                'name' => 'Оптика',
                '__children' => [
                    [
                        'name' => 'Бинокли',
                    ],
                    [
                        'name' => 'Телескопы',
                    ]
                ]
            ]
        ]
    ],
    [
        'name' => 'Крупная бытовая техника',
        '__children' => [
            [
                'name' => 'Холодильники и морозильники',
                '__children' => [
                    [
                        'name' => 'Холодильники',
                    ],
                    [
                        'name' => 'Морозильники',
                    ],
                    [
                        'name' => 'Винные шкафы'
                    ]
                ]
            ],
            [
                'name' => 'Стиральные и сушильные машины',
                '__children' => [
                    [
                        'name' => 'Стиральные машины',
                    ],
                    [
                        'name' => 'Сушильные машины',
                    ],
                    [
                        'name' => 'Паровой шкаф'
                    ],
                    [
                        'name' => 'Аксессуары'
                    ]
                ]
            ],
            [
                'name' => 'Техника для кухни',
                '__children' => [
                    [
                        'name' => 'Газовые плиты',
                    ],
                    [
                        'name' => 'Электрические плиты',
                    ],
                    [
                        'name' => 'Микроволновые печи',
                    ]
                ]
            ]
        ]
    ],
    [
        'name' => 'Малая бытовая техника',
        '__children' => [
            [
                'name' => 'Кухонная техника',
                '__children' => [
                    [
                        'name' => 'Мультиварки',
                    ],
                    [
                        'name' => 'Электрические чайники',
                    ],
                    [
                        'name' => 'Мясорубки'
                    ]
                ]
            ],
            [
                'name' => 'Уход за одеждой и домом',
                '__children' => [
                    [
                        'name' => 'Швейные машины',
                    ],
                    [
                        'name' => 'Отпариватели',
                    ],
                    [
                        'name' => 'Утюги'
                    ],
                    [
                        'name' => 'Парогенераторы'
                    ],
                    [
                        'name' => 'Пылесосы'
                    ]
                ]
            ],
            [
                'name' => 'Климатическая техника',
                '__children' => [
                    [
                        'name' => 'Увлажнители',
                    ],
                    [
                        'name' => 'Обогреватели',
                    ]
                ]
            ]
        ]
    ],
    [
        'name' => 'Автотехника',
        '__children' => [
            [
                'name' => 'Авторегистраторы',
            ],
            [
                'name' => 'Магнитолы',
            ],
            [
                'name' => 'Акустика'
            ]
        ]
    ]
];